In [3]:
import numpy as np
import pandas as pd

In [9]:
# df = pd.DataFrame([['a', 'b', 'c'], [1,2,3]])
# df = pd.DataFrame({'a':[1,2,3], 'b': [5,6,7]})
# valores aleatorios float
# df = pd.DataFrame(np.random.rand(3,2))
# valores aleatorios inteiros
# df = pd.DataFrame(np.random.randint(1, 10, 6).reshape(2,3))
# df = pd.DataFrame(np.random.randint(1, 10, 6).reshape(2,3), columns=["cruzeiro", "atletico", "america"])
df = pd.DataFrame(np.random.randint(1, 10, 6).reshape(2,3), columns=["cruzeiro", "atletico", "america"], index=["gols", "vitorias"])
df

          cruzeiro  atletico  america
gols             7         6        2
vitorias         1         6        3

# seleção de dados

In [11]:
df["atletico"]

gols        6
vitorias    6
Name: atletico, dtype: int64

In [13]:
type(df["atletico"])

pandas.core.series.Series

In [15]:
df["cruzeiro"]["vitorias"]

1

In [17]:
df.cruzeiro

gols        7
vitorias    1
Name: cruzeiro, dtype: int64

In [18]:
df

          cruzeiro  atletico  america
gols             7         6        2
vitorias         1         6        3

In [20]:
# selecina pelo valor do indice
df.loc["vitorias"]

cruzeiro    1
atletico    6
america     3
Name: vitorias, dtype: int64

In [21]:
df.loc[["vitorias"], ["atletico", "america"]]

          atletico  america
vitorias         6        3

In [23]:
# seleciona por linha, posição
df.iloc[0]

cruzeiro    7
atletico    6
america     2
Name: gols, dtype: int64

In [24]:
df.iloc[0, 1 : 3]

atletico    6
america     2
Name: gols, dtype: int64

# adição e remoção de linhas e colunas no dataframe

In [25]:
df

          cruzeiro  atletico  america
gols             7         6        2
vitorias         1         6        3

In [28]:
# adicionar colunas
df["flamengo"] = [3, 17]
df

          cruzeiro  atletico  america  flamengo
gols             7         6        2         3
vitorias         1         6        3        17

In [29]:
# criar linha
df.loc["empates"] = [0,0,0,0]
df

          cruzeiro  atletico  america  flamengo
gols             7         6        2         3
vitorias         1         6        3        17
empates          0         0        0         0

In [31]:
# remover dados
# coluna 1 linha 0
df.drop("america", axis=1, inplace=True)
df

          cruzeiro  atletico  flamengo
gols             7         6         3
vitorias         1         6        17
empates          0         0         0

In [32]:
del df["cruzeiro"]
df

          atletico  flamengo
gols             6         3
vitorias         6        17
empates          0         0

In [34]:
df.drop("empates", axis=0, inplace=True)
df

          atletico  flamengo
gols             6         3
vitorias         6        17

In [41]:
df2 = pd.DataFrame({'a':[1,1,np.nan], 'b': [5,6,7], 'c': [1,4,np.nan]})
df2

     a  b    c
0  1.0  5  1.0
1  1.0  6  4.0
2  NaN  7  NaN

In [42]:
df2.dropna()

     a  b    c
0  1.0  5  1.0
1  1.0  6  4.0

In [44]:
df2.drop_duplicates(subset=["a"])

     a  b    c
0  1.0  5  1.0
2  NaN  7  NaN